{
  "title": "Project Highlights",
  "subtitle": "Designed and developed scalable React.js applications for multiple security-focused products. Built reusable, modular components to improve development speed and maintainability.",
  "posts": [
    {
      "image": "/images/ekasha.png",
      "title": "Ekasha – Incident Management & SOAR Platform",
      "excerpt": "A comprehensive Incident Management & SOAR (Security Orchestration, Automation, and Response) platform that centralizes incident analysis, prioritization, investigation, and automated response workflows, helping security teams streamline operations and manage the full incident lifecycle with real-time collaboration and KPI-driven dashboards. Contribution: Built responsive React.js UI components, implemented state management, and optimized performance for dashboards and alert workflows.",
      "link": "https://www.zeronsec.com/product/ekasha"
    },
    {
      "image": "/images/anrita.png",
      "title": "Anrita – SIEM (Security Information & Event Management)",
      "excerpt": "A next-generation SIEM (Security Information & Event Management) solution that provides real-time threat detection, monitoring, and advanced analytics across networks, endpoints, and cloud systems. It consolidates log data, visualizes security events via dashboards, and empowers analysts with actionable threat insights and customized reporting. Contribution: Developed core frontend modules, integrated complex data visualizations, and ensured real-time interaction with backend systems.",
      "link": "https://www.zeronsec.com/product/anrita"
    },
    {
      "image": "/images/Threati.png",
      "title": "Threati – Threat Intelligence Platform",
      "excerpt": "A platform designed for threat intelligence gathering and analysis, helping organizations identify, assess, and respond to emerging cyber threats by consuming threat feeds and generating actionable insights that drive proactive security decisions. Contribution: Led frontend development using React.js, crafted interactive threat dashboards, and improved usability for security analysts.",
      "link": "https://www.zeronsec.com/product/threati"
    },
    {
      "image": "/images/zeronsec.jpg",
      "title": "Zeronsec - Web Application",
      "excerpt": "A web application built using React.js that provides a secure and efficient way to manage and analyze security data. It includes features for incident management, threat intelligence, and compliance tracking. Contribution: Developed the frontend UI, implemented state management, and integrated with backend APIs.",
      "link": "https://www.zeronsec.com/"
    }
  ]
}
